xml/InformationRegisters/ИИА_СтатусИндексаRAG.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_СтатусИндексаRAG</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Catalogs/ИИА_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИИА_Диалоги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИИА_ТипДиалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОркестраторВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_АвторСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_ТипСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UsageTokens</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусDSL</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_СтатусDSL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml/CommonModules/ИИА_АгентHTTP/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Описание закрытого HTTP API агента. Произвольный BSL и произвольные запросы не поддерживаются.
//
Функция ОписаниеСервиса() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("name", "iia-agent");
	Результат.Вставить("version", ВерсияРасширения());
	Результат.Вставить("safe_mode", Истина);
	Результат.Вставить("execute_bsl", Ложь);
	Результат.Вставить("endpoints", ДопустимыеМаршруты());
	Возврат Результат;
КонецФункции

Функция СведенияОТекущемПользователе() Экспорт
	ИмяПользователя = ИмяАвторизованногоПользователя();
	Настройки = ИИА_Сервер.ПолучитьНастройкиПользователя(ИмяПользователя);
	Результат = Новый Структура;
	Результат.Вставить("user", ИмяПользователя);
	Результат.Вставить("version", ВерсияРасширения());
	Результат.Вставить("model", Строка(Настройки.Модель));
	Результат.Вставить("provider_host", ХостИзURL(Строка(Настройки.Provider_BaseUrl)));
	Результат.Вставить("write_enabled", Настройки.ДоступнаЗапись);
	Возврат Результат;
КонецФункции

Функция СписокДиалогов(Знач Лимит = 20) Экспорт
	ИмяПользователя = ИмяАвторизованногоПользователя();
	Лимит = НормализоватьЛимит(Лимит, 20, 50);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(Лимит, "ЧГ=0") + "
	|	Диалоги.Ссылка КАК Ссылка,
	|	Диалоги.Код КАК Код,
	|	Диалоги.Наименование КАК Наименование,
	|	Диалоги.ТипДиалога КАК ТипДиалога,
	|	Диалоги.ДатаСоздания КАК ДатаСоздания
	|ИЗ
	|	Справочник.ИИА_Диалоги КАК Диалоги
	|ГДЕ
	|	Диалоги.Пользователь = &Пользователь
	|УПОРЯДОЧИТЬ ПО
	|	Диалоги.ДатаСоздания УБЫВ";
	Запрос.УстановитьПараметр("Пользователь", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Элемент.Вставить("code", Строка(Выборка.Код));
		Элемент.Вставить("title", Строка(Выборка.Наименование));
		Элемент.Вставить("type", ИмяТипаДиалога(Выборка.ТипДиалога));
		Элемент.Вставить("created_at", Выборка.ДатаСоздания);
		Результат.Добавить(Элемент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СоздатьДиалог(Знач ТипДиалогаСтрокой = "") Экспорт
	ИмяПользователя = ИмяАвторизованногоПользователя();
	ТипДиалога = ТипДиалогаИзСтроки(ТипДиалогаСтрокой);
	СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог(ИмяПользователя, ТипДиалога);
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		ВызватьИсключение "Не удалось создать диалог.";
	КонецЕсли;
	Возврат ПолучитьСостояниеДиалога(СсылкаДиалога);
КонецФункции

Функция ПолучитьСостояниеДиалога(СсылкаДиалога, Знач ЛимитСообщений = 50) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	ЛимитСообщений = НормализоватьЛимит(ЛимитСообщений, 50, 100);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("code", Строка(СсылкаДиалога.Код));
	Результат.Вставить("title", Строка(СсылкаДиалога.Наименование));
	Результат.Вставить("type", ИмяТипаДиалога(СсылкаДиалога.ТипДиалога));
	Результат.Вставить("created_at", СсылкаДиалога.ДатаСоздания);
	Результат.Вставить("orchestrator_running", ИИА_Сервер.ОркестраторВключенДляДиалога(СсылкаДиалога));
	Результат.Вставить("tokens", ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога));
	Результат.Вставить("why_stopped", ЗначениеДляJSON(ИИА_Сервер.ПочемуОстановилсяОркестратор(СсылкаДиалога)));
	Результат.Вставить("confirmation", СостояниеПодтвержденияДляAPI(СсылкаДиалога));
	Результат.Вставить("messages", ПрочитатьСообщенияДиалога(СсылкаДиалога, ЛимитСообщений));
	Возврат Результат;
КонецФункции

Функция ПолучитьЛогДиалога(СсылкаДиалога, Знач МаксимумСимволов = 200000, Знач Смещение = 0) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	МаксимумСимволов = НормализоватьЛимит(МаксимумСимволов, 200000, 200000);
	Смещение = НормализоватьЛимит(Смещение, 0, 10000000);
	Если Смещение < 0 Тогда
		Смещение = 0;
	КонецЕсли;
	ПолныйТекст = Строка(ИИА_Сервер.ПолучитьЛогДиалога(СсылкаДиалога));
	ПолнаяДлина = СтрДлина(ПолныйТекст);
	Если Смещение > ПолнаяДлина Тогда
		Смещение = ПолнаяДлина;
	КонецЕсли;
	Обрезан = Ложь;
	Если Смещение = 0 Тогда
		ТекстЛога = ПолныйТекст;
		Если СтрДлина(ТекстЛога) > МаксимумСимволов Тогда
			ТекстЛога = Прав(ТекстЛога, МаксимумСимволов);
			Обрезан = Истина;
		КонецЕсли;
	Иначе
		ТекстЛога = Сред(ПолныйТекст, Смещение + 1);
		Если СтрДлина(ТекстЛога) > МаксимумСимволов Тогда
			ТекстЛога = Лев(ТекстЛога, МаксимумСимволов);
			Обрезан = Истина;
		КонецЕсли;
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("log", ТекстЛога);
	Результат.Вставить("offset", Смещение);
	Результат.Вставить("total_length", ПолнаяДлина);
	Результат.Вставить("truncated", Обрезан);
	Возврат Результат;
КонецФункции

Функция ОтправитьИЗапустить(СсылкаДиалога, Текст, Знач ТипДиалогаСтрокой = "") Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Текст = СокрЛП(Строка(Текст));
	Если ПустаяСтрока(Текст) Тогда
		ВызватьИсключение "Текст сообщения пуст.";
	КонецЕсли;
	Если СтрДлина(Текст) > 20000 Тогда
		ВызватьИсключение "Текст сообщения длиннее 20000 символов.";
	КонецЕсли;
	ТипДиалога = СсылкаДиалога.ТипДиалога;
	Если НЕ ПустаяСтрока(СокрЛП(Строка(ТипДиалогаСтрокой))) Тогда
		ТипДиалога = ТипДиалогаИзСтроки(ТипДиалогаСтрокой);
	КонецЕсли;
	ИИА_Оркестратор.ОтправитьИЗапустить(СсылкаДиалога, Текст, ТипДиалога);
	Возврат ПолучитьСостояниеДиалога(СсылкаДиалога);
КонецФункции

Функция ПодтвердитьДействие(СсылкаДиалога, Знач Действие) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	КлючДействия = ВРег(СокрЛП(Строка(Действие)));
	Если КлючДействия = "APPROVE" ИЛИ КлючДействия = "ВЫПОЛНИТЬ" Тогда
		ИИА_ApprovalPolicy.ПодтвердитьОжидающееДействие(СсылкаДиалога);
	ИначеЕсли КлючДействия = "REJECT" ИЛИ КлючДействия = "ОТКЛОНИТЬ" Тогда
		ИИА_ApprovalPolicy.ОтклонитьОжидающееДействие(СсылкаДиалога);
	ИначеЕсли КлючДействия = "APPROVE_WITHOUT_CONFIRMATION" ИЛИ КлючДействия = "ВЫПОЛНЯТЬ_БЕЗ_ПОДТВЕРЖДЕНИЯ" Тогда
		ИИА_ApprovalPolicy.ВключитьРежимБезПодтвержденияИПродолжить(СсылкаДиалога);
	Иначе
		ВызватьИсключение "Неизвестное действие подтверждения: " + Строка(Действие);
	КонецЕсли;
	Возврат ПолучитьСостояниеДиалога(СсылкаДиалога);
КонецФункции

Функция ОстановитьДиалог(СсылкаДиалога) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	ИИА_Оркестратор.Остановить(СсылкаДиалога);
	Возврат ПолучитьСостояниеДиалога(СсылкаДиалога);
КонецФункции

Функция СписокВложенийДиалога(СсылкаДиалога) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Вложения = ИИА_Вложения.ПолучитьВложенияДиалога(СсылкаДиалога);
	Результат = Новый Массив;
	Если Вложения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Для Каждого Вложение Из Вложения Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("id", ЗначениеСвойства(Вложение, "id", ""));
		Элемент.Вставить("file_name", ЗначениеСвойства(Вложение, "file_name", ""));
		Элемент.Вставить("kind", ЗначениеСвойства(Вложение, "kind", ""));
		Элемент.Вставить("mime_type", ЗначениеСвойства(Вложение, "mime_type", ""));
		Элемент.Вставить("size_bytes", ЗначениеСвойства(Вложение, "size_bytes", 0));
		Элемент.Вставить("native_transport", ЗначениеСвойства(Вложение, "native_transport", ""));
		Элемент.Вставить("summary", ЗначениеСвойства(Вложение, "summary", ""));
		Результат.Добавить(Элемент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ДобавитьВложениеДиалога(СсылкаДиалога, ИмяФайла, СодержимоеBase64) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	ИмяФайла = СокрЛП(Строка(ИмяФайла));
	Если ПустаяСтрока(ИмяФайла) Тогда
		ВызватьИсключение "Имя файла не указано.";
	КонецЕсли;
	Если ПустаяСтрока(СокрЛП(Строка(СодержимоеBase64))) Тогда
		ВызватьИсключение "Содержимое файла не передано.";
	КонецЕсли;
	Попытка
		ДвоичныеДанныеФайла = Base64Значение(СодержимоеBase64);
	Исключение
		ВызватьИсключение "Не удалось декодировать content_base64: " + ОписаниеОшибки();
	КонецПопытки;
	Если ДвоичныеДанныеФайла = Неопределено ИЛИ ТипЗнч(ДвоичныеДанныеФайла) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение "content_base64 не содержит двоичные данные.";
	КонецЕсли;
	Если ДвоичныеДанныеФайла.Размер() = 0 Тогда
		ВызватьИсключение "Файл пуст.";
	КонецЕсли;
	Если ДвоичныеДанныеФайла.Размер() > 15 * 1024 * 1024 Тогда
		ВызватьИсключение "Размер файла больше 15 МБ.";
	КонецЕсли;
	Вложение = ИИА_Вложения.ДобавитьВложениеИзДвоичныхДанных(СсылкаДиалога, ИмяФайла, ДвоичныеДанныеФайла);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("attachment_id", ЗначениеСвойства(Вложение, "id", ""));
	Результат.Вставить("file_name", ЗначениеСвойства(Вложение, "file_name", ИмяФайла));
	Результат.Вставить("kind", ЗначениеСвойства(Вложение, "kind", ""));
	Результат.Вставить("size_bytes", ЗначениеСвойства(Вложение, "size_bytes", ДвоичныеДанныеФайла.Размер()));
	Возврат Результат;
КонецФункции

Функция ПочемуОстановился(СсылкаДиалога) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("running", ИИА_Сервер.ОркестраторВключенДляДиалога(СсылкаДиалога));
	Результат.Вставить("why_stopped", ЗначениеДляJSON(ИИА_Сервер.ПочемуОстановилсяОркестратор(СсылкаДиалога)));
	Возврат Результат;
КонецФункции

Функция ПолучитьМетрикиДиалога(СсылкаДиалога) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("tokens", ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога));
	Результат.Вставить("metrics", ЗначениеДляJSON(ИИА_Сервер.ПолучитьМетрикиОркестратора(СсылкаДиалога)));
	Возврат Результат;
КонецФункции

Функция ПолучитьТрассировкуДиалога(СсылкаДиалога, Знач Лимит = 100) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Лимит = НормализоватьЛимит(Лимит, 100, 200);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("events", ЗначениеДляJSON(ИИА_Сервер.ПолучитьRuntimeTrace(СсылкаДиалога, Лимит)));
	Возврат Результат;
КонецФункции

Функция ПолучитьЛентуРешений(СсылкаДиалога, Знач Лимит = 20) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Лимит = НормализоватьЛимит(Лимит, 20, 100);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("timeline", ЗначениеДляJSON(ИИА_Сервер.ПолучитьDecisionTimeline(СсылкаДиалога, Лимит)));
	Возврат Результат;
КонецФункции

Функция ПолучитьЦепочкиСбоев(СсылкаДиалога, Знач Лимит = 5) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Лимит = НормализоватьЛимит(Лимит, 5, 20);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("failures", ЗначениеДляJSON(ИИА_Сервер.ПолучитьЦепочкиСбоевОркестратора(СсылкаДиалога, Лимит)));
	Возврат Результат;
КонецФункции

Функция ПолучитьЧекпоинтыДиалога(СсылкаДиалога, Знач Лимит = 20) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Лимит = НормализоватьЛимит(Лимит, 20, 100);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("checkpoints", ЗначениеДляJSON(ИИА_Сервер.ПолучитьИсториюЧекпоинтовОркестратора(СсылкаДиалога, Лимит)));
	Возврат Результат;
КонецФункции

Функция ПолучитьDiffЧекпоинтовДиалога(СсылкаДиалога, Знач ИндексДо = -1, Знач ИндексПосле = -1) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("diff", ЗначениеДляJSON(ИИА_Сервер.ПолучитьDiffЧекпоинтовОркестратора(СсылкаДиалога, ЧислоИзЗначения(ИндексДо, -1), ЧислоИзЗначения(ИндексПосле, -1))));
	Возврат Результат;
КонецФункции

Функция ВозобновитьДиалог(СсылкаДиалога, Знач ИндексЧекпоинта = -1, Знач АвтоЗапуск = Истина) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	ИндексЧекпоинта = ЧислоИзЗначения(ИндексЧекпоинта, -1);
	Если ТипЗнч(АвтоЗапуск) <> Тип("Булево") Тогда
		АвтоЗапуск = Истина;
	КонецЕсли;
	Если НЕ ИИА_Оркестратор.ВозобновитьСЧекпоинта(СсылкаДиалога, ИндексЧекпоинта, АвтоЗапуск) Тогда
		ВызватьИсключение "Не удалось возобновить диалог с чекпоинта.";
	КонецЕсли;
	Возврат ПолучитьСостояниеДиалога(СсылкаДиалога);
КонецФункции

Функция ПолучитьОбъектыДиалога(СсылкаДиалога) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзмененныеОбъекты.СсылкаНаОбъект КАК СсылкаНаОбъект
	|ИЗ
	|	Справочник.ИИА_Диалоги.ИзмененныеОбъекты КАК ИзмененныеОбъекты
	|ГДЕ
	|	ИзмененныеОбъекты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
	Выборка = Запрос.Выполнить().Выбрать();
	Объекты = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.СсылкаНаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		НавигационнаяСсылка = "";
		Попытка
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Выборка.СсылкаНаОбъект);
		Исключение
			НавигационнаяСсылка = "";
		КонецПопытки;
		Элемент = Новый Структура;
		Элемент.Вставить("presentation", Строка(Выборка.СсылкаНаОбъект));
		Элемент.Вставить("type", Строка(ТипЗнч(Выборка.СсылкаНаОбъект)));
		Элемент.Вставить("nav", НавигационнаяСсылка);
		Объекты.Добавить(Элемент);
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("objects", Объекты);
	Возврат Результат;
КонецФункции

Функция ПолучитьРезультатЗапросаДиалога(СсылкаДиалога, Знач Лимит = 30) Экспорт
	СсылкаДиалога = ПолучитьДоступныйДиалог(СсылкаДиалога);
	Лимит = НормализоватьЛимит(Лимит, 30, 50);
	ДанныеЗапроса = ИИА_Сервер.ПолучитьПоследниеДанныеЗапроса(СсылкаДиалога);
	Строки = Новый Массив;
	Всего = 0;
	Если ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		Всего = ДанныеЗапроса.Количество();
		Граница = Мин(Всего, Лимит);
		Для Индекс = 0 По Граница - 1 Цикл
			Строки.Добавить(ЗначениеДляJSON(ДанныеЗапроса[Индекс]));
		КонецЦикла;
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("id", Строка(СсылкаДиалога.УникальныйИдентификатор()));
	Результат.Вставить("row_count", Всего);
	Результат.Вставить("rows", Строки);
	Результат.Вставить("truncated", Всего > Строки.Количество());
	Возврат Результат;
КонецФункции

Функция ПолучитьСтатусRAG() Экспорт
	ИмяАвторизованногоПользователя();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статус.ИмяКонфигурации КАК ИмяКонфигурации,
	|	Статус.ДатаСборки КАК ДатаСборки,
	|	Статус.ВерсияКонфигурации КАК ВерсияКонфигурации
	|ИЗ
	|	РегистрСведений.ИИА_СтатусИндексаRAG КАК Статус";
	Выборка = Запрос.Выполнить().Выбрать();
	Индексы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("configuration", Строка(Выборка.ИмяКонфигурации));
		Элемент.Вставить("built_at", Выборка.ДатаСборки);
		Элемент.Вставить("configuration_version", Строка(Выборка.ВерсияКонфигурации));
		Элемент.Вставить("indexed", ЗначениеЗаполнено(Выборка.ДатаСборки));
		Индексы.Добавить(Элемент);
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("indexes", Индексы);
	Возврат Результат;
КонецФункции

Функция ПрочитатьЖурналРегистрацииАгента(Знач Минут = 30, Знач Лимит = 50, Знач УровеньСтрокой = "") Экспорт
	ИмяПользователя = ИмяАвторизованногоПользователя();
	Минут = НормализоватьЛимит(Минут, 30, 1440);
	Лимит = НормализоватьЛимит(Лимит, 50, 100);
	ДатаОкончания = ТекущаяДата();
	ДатаНачала = ДатаОкончания - Минут * 60;
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", ДатаНачала);
	Отбор.Вставить("ДатаОкончания", ДатаОкончания);
	Отбор.Вставить("Пользователь", ИмяПользователя);
	УровеньЖурнала = УровеньЖурналаИзСтроки(УровеньСтрокой);
	Если УровеньЖурнала <> Неопределено Тогда
		Отбор.Вставить("Уровень", УровеньЖурнала);
	КонецЕсли;
	ТаблицаЖурнала = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(ТаблицаЖурнала, Отбор, "Дата,Уровень,Событие,Пользователь,Комментарий,Метаданные", , Лимит);
	События = Новый Массив;
	Для Каждого СтрокаЖурнала Из ТаблицаЖурнала Цикл
		Комментарий = Строка(СтрокаЖурнала.Комментарий);
		Если СтрДлина(Комментарий) > 2000 Тогда
			Комментарий = Лев(Комментарий, 2000);
		КонецЕсли;
		Элемент = Новый Структура;
		Элемент.Вставить("date", СтрокаЖурнала.Дата);
		Элемент.Вставить("level", Строка(СтрокаЖурнала.Уровень));
		Элемент.Вставить("event", Строка(СтрокаЖурнала.Событие));
		Элемент.Вставить("user", Строка(СтрокаЖурнала.Пользователь));
		Элемент.Вставить("metadata", Строка(СтрокаЖурнала.Метаданные));
		Элемент.Вставить("comment", Комментарий);
		События.Добавить(Элемент);
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("from", ДатаНачала);
	Результат.Вставить("to", ДатаОкончания);
	Результат.Вставить("events", События);
	Возврат Результат;
КонецФункции

Функция ПолучитьДоступныйДиалог(ИдентификаторИлиСсылка) Экспорт
	СсылкаДиалога = НайтиДиалогПоИдентификатору(ИдентификаторИлиСсылка);
	ИмяПользователя = ИмяАвторизованногоПользователя();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Диалоги.Ссылка КАК Ссылка,
	|	Диалоги.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ИИА_Диалоги КАК Диалоги
	|ГДЕ
	|	Диалоги.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Диалог не найден.";
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Строка(Выборка.Пользователь) <> ИмяПользователя Тогда
		ВызватьИсключение "Нет доступа к диалогу.";
	КонецЕсли;
	Возврат Выборка.Ссылка;
КонецФункции

Функция ПрочитатьТелоJSON(ТекстТела) Экспорт
	Если ПустаяСтрока(СокрЛП(Строка(ТекстТела))) Тогда
		Возврат Новый Структура;
	КонецЕсли;
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстТела);
		Данные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ВызватьИсключение "Тело запроса должно быть валидным JSON: " + ОписаниеОшибки();
	КонецПопытки;
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		ВызватьИсключение "Тело запроса должно быть JSON-объектом.";
	КонецЕсли;
	Возврат Данные;
КонецФункции

Функция ЗаписатьJSONСтроку(Значение) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяАвторизованногоПользователя()
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ = Неопределено ИЛИ ПустаяСтрока(ПользовательИБ.Имя) Тогда
		ВызватьИсключение "Требуется аутентификация.";
	КонецЕсли;
	Возврат ПользовательИБ.Имя;
КонецФункции

Функция ВерсияРасширения()
	Возврат Строка(Метаданные.Версия);
КонецФункции

Функция ДопустимыеМаршруты()
	Маршруты = Новый Массив;
	Маршруты.Добавить("GET /health");
	Маршруты.Добавить("GET /v1/me");
	Маршруты.Добавить("GET /v1/dialogs");
	Маршруты.Добавить("POST /v1/dialogs");
	Маршруты.Добавить("GET /v1/dialogs/{id}");
	Маршруты.Добавить("GET /v1/dialogs/{id}/log");
	Маршруты.Добавить("POST /v1/dialogs/{id}/send");
	Маршруты.Добавить("POST /v1/dialogs/{id}/confirm");
	Маршруты.Добавить("POST /v1/dialogs/{id}/stop");
	Маршруты.Добавить("GET /v1/dialogs/{id}/attachments");
	Маршруты.Добавить("POST /v1/dialogs/{id}/attachments");
	Маршруты.Добавить("GET /v1/dialogs/{id}/why-stopped");
	Маршруты.Добавить("GET /v1/dialogs/{id}/metrics");
	Маршруты.Добавить("GET /v1/dialogs/{id}/trace");
	Маршруты.Добавить("GET /v1/dialogs/{id}/timeline");
	Маршруты.Добавить("GET /v1/dialogs/{id}/failures");
	Маршруты.Добавить("GET /v1/dialogs/{id}/checkpoints");
	Маршруты.Добавить("GET /v1/dialogs/{id}/checkpoints/diff");
	Маршруты.Добавить("POST /v1/dialogs/{id}/resume");
	Маршруты.Добавить("GET /v1/dialogs/{id}/objects");
	Маршруты.Добавить("GET /v1/dialogs/{id}/query-result");
	Маршруты.Добавить("GET /v1/event-log");
	Маршруты.Добавить("GET /v1/rag/status");
	Возврат Маршруты;
КонецФункции

Функция НайтиДиалогПоИдентификатору(ИдентификаторИлиСсылка)
	Если ТипЗнч(ИдентификаторИлиСсылка) = Тип("СправочникСсылка.ИИА_Диалоги") Тогда
		Если НЕ ЗначениеЗаполнено(ИдентификаторИлиСсылка) Тогда
			ВызватьИсключение "Диалог не указан.";
		КонецЕсли;
		Возврат ИдентификаторИлиСсылка;
	КонецЕсли;
	ТекстИдентификатора = СокрЛП(Строка(ИдентификаторИлиСсылка));
	Если ПустаяСтрока(ТекстИдентификатора) Тогда
		ВызватьИсключение "Идентификатор диалога не указан.";
	КонецЕсли;
	Попытка
		УникальныйИдентификаторДиалога = Новый УникальныйИдентификатор(ТекстИдентификатора);
	Исключение
		ВызватьИсключение "Некорректный идентификатор диалога.";
	КонецПопытки;
	Возврат Справочники.ИИА_Диалоги.ПолучитьСсылку(УникальныйИдентификаторДиалога);
КонецФункции

Функция ПрочитатьСообщенияДиалога(СсылкаДиалога, ЛимитСообщений)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сообщения.НомерСтроки КАК НомерСтроки,
	|	Сообщения.Время КАК Время,
	|	Сообщения.Автор КАК Автор,
	|	Сообщения.ТипСообщения КАК ТипСообщения,
	|	Сообщения.Текст КАК Текст,
	|	Сообщения.Статус КАК Статус,
	|	Сообщения.УИД КАК УИД
	|ИЗ
	|	Справочник.ИИА_Диалоги.Сообщения КАК Сообщения
	|ГДЕ
	|	Сообщения.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
	ТаблицаСообщений = Запрос.Выполнить().Выгрузить();
	ИндексНачала = 0;
	Если ЛимитСообщений > 0 И ТаблицаСообщений.Количество() > ЛимитСообщений Тогда
		ИндексНачала = ТаблицаСообщений.Количество() - ЛимитСообщений;
	КонецЕсли;
	Результат = Новый Массив;
	Для Индекс = ИндексНачала По ТаблицаСообщений.Количество() - 1 Цикл
		СтрокаСообщения = ТаблицаСообщений[Индекс];
		ТекстСообщения = Строка(СтрокаСообщения.Текст);
		Если СтрДлина(ТекстСообщения) > 4000 Тогда
			ТекстСообщения = Лев(ТекстСообщения, 4000);
		КонецЕсли;
		Элемент = Новый Структура;
		Элемент.Вставить("id", Строка(СтрокаСообщения.УИД));
		Элемент.Вставить("time", СтрокаСообщения.Время);
		Элемент.Вставить("author", Строка(СтрокаСообщения.Автор));
		Элемент.Вставить("type", Строка(СтрокаСообщения.ТипСообщения));
		Элемент.Вставить("text", ТекстСообщения);
		Элемент.Вставить("status", Строка(СтрокаСообщения.Статус));
		Результат.Добавить(Элемент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СостояниеПодтвержденияДляAPI(СсылкаДиалога)
	Состояние = ИИА_Сервер.ПолучитьСостояниеПодтверждения(СсылкаДиалога);
	Результат = Новый Структура;
	Результат.Вставить("status", ЗначениеСвойства(Состояние, "status", ""));
	Результат.Вставить("risk_level", ЗначениеСвойства(Состояние, "risk_level", ""));
	Результат.Вставить("reason", ЗначениеСвойства(Состояние, "reason", ""));
	Результат.Вставить("preview", ЗначениеСвойства(Состояние, "preview", ""));
	Результат.Вставить("pending", ВРег(Строка(Результат.status)) = "PENDING");
	Возврат Результат;
КонецФункции

Функция ТипДиалогаИзСтроки(ТипДиалогаСтрокой)
	Ключ = ВРег(СокрЛП(Строка(ТипДиалогаСтрокой)));
	Если ПустаяСтрока(Ключ) ИЛИ Ключ = "AGENT" ИЛИ Ключ = "АГЕНТ" Тогда
		Возврат Перечисления.ИИА_ТипДиалога.Агент;
	КонецЕсли;
	Если Ключ = "QUERY1C" ИЛИ Ключ = "ЗАПРОС1С" Тогда
		Возврат Перечисления.ИИА_ТипДиалога.Запрос1С;
	КонецЕсли;
	Если Ключ = "DOCUMENT_RECOGNITION" ИЛИ Ключ = "РАСПОЗНАВАНИЕДОКУМЕНТОВ" Тогда
		Возврат Перечисления.ИИА_ТипДиалога.РаспознаваниеДокументов;
	КонецЕсли;
	ВызватьИсключение "Неизвестный тип диалога: " + Строка(ТипДиалогаСтрокой);
КонецФункции

Функция ИмяТипаДиалога(ТипДиалога)
	Если ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
		Возврат "query1c";
	КонецЕсли;
	Если ТипДиалога = Перечисления.ИИА_ТипДиалога.РаспознаваниеДокументов Тогда
		Возврат "document_recognition";
	КонецЕсли;
	Возврат "agent";
КонецФункции

Функция УровеньЖурналаИзСтроки(УровеньСтрокой)
	Ключ = ВРег(СокрЛП(Строка(УровеньСтрокой)));
	Если ПустаяСтрока(Ключ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Ключ = "ERROR" ИЛИ Ключ = "ОШИБКА" Тогда
		Возврат УровеньЖурналаРегистрации.Ошибка;
	КонецЕсли;
	Если Ключ = "WARNING" ИЛИ Ключ = "ПРЕДУПРЕЖДЕНИЕ" Тогда
		Возврат УровеньЖурналаРегистрации.Предупреждение;
	КонецЕсли;
	Если Ключ = "INFORMATION" ИЛИ Ключ = "ИНФОРМАЦИЯ" Тогда
		Возврат УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	ВызватьИсключение "Неизвестный уровень журнала: " + Строка(УровеньСтрокой);
КонецФункции

Функция НормализоватьЛимит(Значение, ЗначениеПоУмолчанию, Максимум)
	ЧисловоеЗначение = ЗначениеПоУмолчанию;
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		ЧисловоеЗначение = Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") И НЕ ПустаяСтрока(СокрЛП(Значение)) Тогда
		Попытка
			ЧисловоеЗначение = Число(СокрЛП(Значение));
		Исключение
			ВызватьИсключение "Некорректное числовое значение: " + Строка(Значение);
		КонецПопытки;
	КонецЕсли;
	Если ЧисловоеЗначение <= 0 Тогда
		ЧисловоеЗначение = ЗначениеПоУмолчанию;
	КонецЕсли;
	Если ЧисловоеЗначение > Максимум Тогда
		ЧисловоеЗначение = Максимум;
	КонецЕсли;
	Возврат Цел(ЧисловоеЗначение);
КонецФункции

Функция ХостИзURL(URL)
	ТекстURL = СокрЛП(Строка(URL));
	Если ПустаяСтрока(ТекстURL) Тогда
		Возврат "";
	КонецЕсли;
	БезСхемы = ТекстURL;
	ПозицияСхемы = СтрНайти(ТекстURL, "://");
	Если ПозицияСхемы > 0 Тогда
		БезСхемы = Сред(ТекстURL, ПозицияСхемы + 3);
	КонецЕсли;
	ПозицияПути = СтрНайти(БезСхемы, "/");
	Если ПозицияПути > 0 Тогда
		БезСхемы = Лев(БезСхемы, ПозицияПути - 1);
	КонецЕсли;
	Возврат БезСхемы;
КонецФункции

Функция ЧислоИзЗначения(Значение, ЗначениеПоУмолчанию)
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Цел(Значение);
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Строка") И НЕ ПустаяСтрока(СокрЛП(Значение)) Тогда
		Попытка
			Возврат Цел(Число(СокрЛП(Значение)));
		Исключение
			ВызватьИсключение "Некорректное числовое значение: " + Строка(Значение);
		КонецПопытки;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ЗначениеДляJSON(Значение)
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Строка")
		ИЛИ ТипЗначения = Тип("Число")
		ИЛИ ТипЗначения = Тип("Булево")
		ИЛИ ТипЗначения = Тип("Дата") Тогда
		Возврат Значение;
	КонецЕсли;
	Если ТипЗначения = Тип("Структура") Тогда
		Результат = Новый Структура;
		Для Каждого КлючИЗначение Из Значение Цикл
			Результат.Вставить(КлючИЗначение.Ключ, ЗначениеДляJSON(КлючИЗначение.Значение));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	Если ТипЗначения = Тип("Массив") Тогда
		Результат = Новый Массив;
		Для Каждого Элемент Из Значение Цикл
			Результат.Добавить(ЗначениеДляJSON(Элемент));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	Если ТипЗначения = Тип("Соответствие") Тогда
		Результат = Новый Массив;
		Для Каждого КлючИЗначение Из Значение Цикл
			Элемент = Новый Структура;
			Элемент.Вставить("key", Строка(КлючИЗначение.Ключ));
			Элемент.Вставить("value", ЗначениеДляJSON(КлючИЗначение.Значение));
			Результат.Добавить(Элемент);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	Возврат Строка(Значение);
КонецФункции

Функция ЗначениеСвойства(Коллекция, ИмяСвойства, ЗначениеПоУмолчанию)
	Если Коллекция = Неопределено ИЛИ ТипЗнч(Коллекция) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Значение = Неопределено;
	Если Коллекция.Свойство(ИмяСвойства, Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

#КонецОбласти
